###################################################################

# Created by write_sdc on Fri Dec 1 16:26:24 2023

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_load -pin_load 0.1 [get_ports {C[127]}]
set_load -pin_load 0.1 [get_ports {C[126]}]
set_load -pin_load 0.1 [get_ports {C[125]}]
set_load -pin_load 0.1 [get_ports {C[124]}]
set_load -pin_load 0.1 [get_ports {C[123]}]
set_load -pin_load 0.1 [get_ports {C[122]}]
set_load -pin_load 0.1 [get_ports {C[121]}]
set_load -pin_load 0.1 [get_ports {C[120]}]
set_load -pin_load 0.1 [get_ports {C[119]}]
set_load -pin_load 0.1 [get_ports {C[118]}]
set_load -pin_load 0.1 [get_ports {C[117]}]
set_load -pin_load 0.1 [get_ports {C[116]}]
set_load -pin_load 0.1 [get_ports {C[115]}]
set_load -pin_load 0.1 [get_ports {C[114]}]
set_load -pin_load 0.1 [get_ports {C[113]}]
set_load -pin_load 0.1 [get_ports {C[112]}]
set_load -pin_load 0.1 [get_ports {C[111]}]
set_load -pin_load 0.1 [get_ports {C[110]}]
set_load -pin_load 0.1 [get_ports {C[109]}]
set_load -pin_load 0.1 [get_ports {C[108]}]
set_load -pin_load 0.1 [get_ports {C[107]}]
set_load -pin_load 0.1 [get_ports {C[106]}]
set_load -pin_load 0.1 [get_ports {C[105]}]
set_load -pin_load 0.1 [get_ports {C[104]}]
set_load -pin_load 0.1 [get_ports {C[103]}]
set_load -pin_load 0.1 [get_ports {C[102]}]
set_load -pin_load 0.1 [get_ports {C[101]}]
set_load -pin_load 0.1 [get_ports {C[100]}]
set_load -pin_load 0.1 [get_ports {C[99]}]
set_load -pin_load 0.1 [get_ports {C[98]}]
set_load -pin_load 0.1 [get_ports {C[97]}]
set_load -pin_load 0.1 [get_ports {C[96]}]
set_load -pin_load 0.1 [get_ports {C[95]}]
set_load -pin_load 0.1 [get_ports {C[94]}]
set_load -pin_load 0.1 [get_ports {C[93]}]
set_load -pin_load 0.1 [get_ports {C[92]}]
set_load -pin_load 0.1 [get_ports {C[91]}]
set_load -pin_load 0.1 [get_ports {C[90]}]
set_load -pin_load 0.1 [get_ports {C[89]}]
set_load -pin_load 0.1 [get_ports {C[88]}]
set_load -pin_load 0.1 [get_ports {C[87]}]
set_load -pin_load 0.1 [get_ports {C[86]}]
set_load -pin_load 0.1 [get_ports {C[85]}]
set_load -pin_load 0.1 [get_ports {C[84]}]
set_load -pin_load 0.1 [get_ports {C[83]}]
set_load -pin_load 0.1 [get_ports {C[82]}]
set_load -pin_load 0.1 [get_ports {C[81]}]
set_load -pin_load 0.1 [get_ports {C[80]}]
set_load -pin_load 0.1 [get_ports {C[79]}]
set_load -pin_load 0.1 [get_ports {C[78]}]
set_load -pin_load 0.1 [get_ports {C[77]}]
set_load -pin_load 0.1 [get_ports {C[76]}]
set_load -pin_load 0.1 [get_ports {C[75]}]
set_load -pin_load 0.1 [get_ports {C[74]}]
set_load -pin_load 0.1 [get_ports {C[73]}]
set_load -pin_load 0.1 [get_ports {C[72]}]
set_load -pin_load 0.1 [get_ports {C[71]}]
set_load -pin_load 0.1 [get_ports {C[70]}]
set_load -pin_load 0.1 [get_ports {C[69]}]
set_load -pin_load 0.1 [get_ports {C[68]}]
set_load -pin_load 0.1 [get_ports {C[67]}]
set_load -pin_load 0.1 [get_ports {C[66]}]
set_load -pin_load 0.1 [get_ports {C[65]}]
set_load -pin_load 0.1 [get_ports {C[64]}]
set_load -pin_load 0.1 [get_ports {C[63]}]
set_load -pin_load 0.1 [get_ports {C[62]}]
set_load -pin_load 0.1 [get_ports {C[61]}]
set_load -pin_load 0.1 [get_ports {C[60]}]
set_load -pin_load 0.1 [get_ports {C[59]}]
set_load -pin_load 0.1 [get_ports {C[58]}]
set_load -pin_load 0.1 [get_ports {C[57]}]
set_load -pin_load 0.1 [get_ports {C[56]}]
set_load -pin_load 0.1 [get_ports {C[55]}]
set_load -pin_load 0.1 [get_ports {C[54]}]
set_load -pin_load 0.1 [get_ports {C[53]}]
set_load -pin_load 0.1 [get_ports {C[52]}]
set_load -pin_load 0.1 [get_ports {C[51]}]
set_load -pin_load 0.1 [get_ports {C[50]}]
set_load -pin_load 0.1 [get_ports {C[49]}]
set_load -pin_load 0.1 [get_ports {C[48]}]
set_load -pin_load 0.1 [get_ports {C[47]}]
set_load -pin_load 0.1 [get_ports {C[46]}]
set_load -pin_load 0.1 [get_ports {C[45]}]
set_load -pin_load 0.1 [get_ports {C[44]}]
set_load -pin_load 0.1 [get_ports {C[43]}]
set_load -pin_load 0.1 [get_ports {C[42]}]
set_load -pin_load 0.1 [get_ports {C[41]}]
set_load -pin_load 0.1 [get_ports {C[40]}]
set_load -pin_load 0.1 [get_ports {C[39]}]
set_load -pin_load 0.1 [get_ports {C[38]}]
set_load -pin_load 0.1 [get_ports {C[37]}]
set_load -pin_load 0.1 [get_ports {C[36]}]
set_load -pin_load 0.1 [get_ports {C[35]}]
set_load -pin_load 0.1 [get_ports {C[34]}]
set_load -pin_load 0.1 [get_ports {C[33]}]
set_load -pin_load 0.1 [get_ports {C[32]}]
set_load -pin_load 0.1 [get_ports {C[31]}]
set_load -pin_load 0.1 [get_ports {C[30]}]
set_load -pin_load 0.1 [get_ports {C[29]}]
set_load -pin_load 0.1 [get_ports {C[28]}]
set_load -pin_load 0.1 [get_ports {C[27]}]
set_load -pin_load 0.1 [get_ports {C[26]}]
set_load -pin_load 0.1 [get_ports {C[25]}]
set_load -pin_load 0.1 [get_ports {C[24]}]
set_load -pin_load 0.1 [get_ports {C[23]}]
set_load -pin_load 0.1 [get_ports {C[22]}]
set_load -pin_load 0.1 [get_ports {C[21]}]
set_load -pin_load 0.1 [get_ports {C[20]}]
set_load -pin_load 0.1 [get_ports {C[19]}]
set_load -pin_load 0.1 [get_ports {C[18]}]
set_load -pin_load 0.1 [get_ports {C[17]}]
set_load -pin_load 0.1 [get_ports {C[16]}]
set_load -pin_load 0.1 [get_ports {C[15]}]
set_load -pin_load 0.1 [get_ports {C[14]}]
set_load -pin_load 0.1 [get_ports {C[13]}]
set_load -pin_load 0.1 [get_ports {C[12]}]
set_load -pin_load 0.1 [get_ports {C[11]}]
set_load -pin_load 0.1 [get_ports {C[10]}]
set_load -pin_load 0.1 [get_ports {C[9]}]
set_load -pin_load 0.1 [get_ports {C[8]}]
set_load -pin_load 0.1 [get_ports {C[7]}]
set_load -pin_load 0.1 [get_ports {C[6]}]
set_load -pin_load 0.1 [get_ports {C[5]}]
set_load -pin_load 0.1 [get_ports {C[4]}]
set_load -pin_load 0.1 [get_ports {C[3]}]
set_load -pin_load 0.1 [get_ports {C[2]}]
set_load -pin_load 0.1 [get_ports {C[1]}]
set_load -pin_load 0.1 [get_ports {C[0]}]
set_max_fanout 50 [get_ports clk]
set_max_fanout 50 [get_ports resetn]
set_max_fanout 50 [get_ports {A[31]}]
set_max_fanout 50 [get_ports {A[30]}]
set_max_fanout 50 [get_ports {A[29]}]
set_max_fanout 50 [get_ports {A[28]}]
set_max_fanout 50 [get_ports {A[27]}]
set_max_fanout 50 [get_ports {A[26]}]
set_max_fanout 50 [get_ports {A[25]}]
set_max_fanout 50 [get_ports {A[24]}]
set_max_fanout 50 [get_ports {A[23]}]
set_max_fanout 50 [get_ports {A[22]}]
set_max_fanout 50 [get_ports {A[21]}]
set_max_fanout 50 [get_ports {A[20]}]
set_max_fanout 50 [get_ports {A[19]}]
set_max_fanout 50 [get_ports {A[18]}]
set_max_fanout 50 [get_ports {A[17]}]
set_max_fanout 50 [get_ports {A[16]}]
set_max_fanout 50 [get_ports {A[15]}]
set_max_fanout 50 [get_ports {A[14]}]
set_max_fanout 50 [get_ports {A[13]}]
set_max_fanout 50 [get_ports {A[12]}]
set_max_fanout 50 [get_ports {A[11]}]
set_max_fanout 50 [get_ports {A[10]}]
set_max_fanout 50 [get_ports {A[9]}]
set_max_fanout 50 [get_ports {A[8]}]
set_max_fanout 50 [get_ports {A[7]}]
set_max_fanout 50 [get_ports {A[6]}]
set_max_fanout 50 [get_ports {A[5]}]
set_max_fanout 50 [get_ports {A[4]}]
set_max_fanout 50 [get_ports {A[3]}]
set_max_fanout 50 [get_ports {A[2]}]
set_max_fanout 50 [get_ports {A[1]}]
set_max_fanout 50 [get_ports {A[0]}]
set_max_fanout 50 [get_ports {B[31]}]
set_max_fanout 50 [get_ports {B[30]}]
set_max_fanout 50 [get_ports {B[29]}]
set_max_fanout 50 [get_ports {B[28]}]
set_max_fanout 50 [get_ports {B[27]}]
set_max_fanout 50 [get_ports {B[26]}]
set_max_fanout 50 [get_ports {B[25]}]
set_max_fanout 50 [get_ports {B[24]}]
set_max_fanout 50 [get_ports {B[23]}]
set_max_fanout 50 [get_ports {B[22]}]
set_max_fanout 50 [get_ports {B[21]}]
set_max_fanout 50 [get_ports {B[20]}]
set_max_fanout 50 [get_ports {B[19]}]
set_max_fanout 50 [get_ports {B[18]}]
set_max_fanout 50 [get_ports {B[17]}]
set_max_fanout 50 [get_ports {B[16]}]
set_max_fanout 50 [get_ports {B[15]}]
set_max_fanout 50 [get_ports {B[14]}]
set_max_fanout 50 [get_ports {B[13]}]
set_max_fanout 50 [get_ports {B[12]}]
set_max_fanout 50 [get_ports {B[11]}]
set_max_fanout 50 [get_ports {B[10]}]
set_max_fanout 50 [get_ports {B[9]}]
set_max_fanout 50 [get_ports {B[8]}]
set_max_fanout 50 [get_ports {B[7]}]
set_max_fanout 50 [get_ports {B[6]}]
set_max_fanout 50 [get_ports {B[5]}]
set_max_fanout 50 [get_ports {B[4]}]
set_max_fanout 50 [get_ports {B[3]}]
set_max_fanout 50 [get_ports {B[2]}]
set_max_fanout 50 [get_ports {B[1]}]
set_max_fanout 50 [get_ports {B[0]}]
set_max_fanout 50 [get_ports {op[1]}]
set_max_fanout 50 [get_ports {op[0]}]
create_clock [get_ports clk]  -name main_clk  -period 40  -waveform {0 20}
set_clock_uncertainty -setup 0.2  [get_clocks main_clk]
set_clock_uncertainty -hold 0.05  [get_clocks main_clk]
set_input_delay -clock main_clk  -max 10  [get_ports clk]
set_input_delay -clock main_clk  -min 6  [get_ports clk]
set_input_delay -clock main_clk  -max 10  [get_ports resetn]
set_input_delay -clock main_clk  -min 6  [get_ports resetn]
set_input_delay -clock main_clk  -max 10  [get_ports {A[31]}]
set_input_delay -clock main_clk  -min 6  [get_ports {A[31]}]
set_input_delay -clock main_clk  -max 10  [get_ports {A[30]}]
set_input_delay -clock main_clk  -min 6  [get_ports {A[30]}]
set_input_delay -clock main_clk  -max 10  [get_ports {A[29]}]
set_input_delay -clock main_clk  -min 6  [get_ports {A[29]}]
set_input_delay -clock main_clk  -max 10  [get_ports {A[28]}]
set_input_delay -clock main_clk  -min 6  [get_ports {A[28]}]
set_input_delay -clock main_clk  -max 10  [get_ports {A[27]}]
set_input_delay -clock main_clk  -min 6  [get_ports {A[27]}]
set_input_delay -clock main_clk  -max 10  [get_ports {A[26]}]
set_input_delay -clock main_clk  -min 6  [get_ports {A[26]}]
set_input_delay -clock main_clk  -max 10  [get_ports {A[25]}]
set_input_delay -clock main_clk  -min 6  [get_ports {A[25]}]
set_input_delay -clock main_clk  -max 10  [get_ports {A[24]}]
set_input_delay -clock main_clk  -min 6  [get_ports {A[24]}]
set_input_delay -clock main_clk  -max 10  [get_ports {A[23]}]
set_input_delay -clock main_clk  -min 6  [get_ports {A[23]}]
set_input_delay -clock main_clk  -max 10  [get_ports {A[22]}]
set_input_delay -clock main_clk  -min 6  [get_ports {A[22]}]
set_input_delay -clock main_clk  -max 10  [get_ports {A[21]}]
set_input_delay -clock main_clk  -min 6  [get_ports {A[21]}]
set_input_delay -clock main_clk  -max 10  [get_ports {A[20]}]
set_input_delay -clock main_clk  -min 6  [get_ports {A[20]}]
set_input_delay -clock main_clk  -max 10  [get_ports {A[19]}]
set_input_delay -clock main_clk  -min 6  [get_ports {A[19]}]
set_input_delay -clock main_clk  -max 10  [get_ports {A[18]}]
set_input_delay -clock main_clk  -min 6  [get_ports {A[18]}]
set_input_delay -clock main_clk  -max 10  [get_ports {A[17]}]
set_input_delay -clock main_clk  -min 6  [get_ports {A[17]}]
set_input_delay -clock main_clk  -max 10  [get_ports {A[16]}]
set_input_delay -clock main_clk  -min 6  [get_ports {A[16]}]
set_input_delay -clock main_clk  -max 10  [get_ports {A[15]}]
set_input_delay -clock main_clk  -min 6  [get_ports {A[15]}]
set_input_delay -clock main_clk  -max 10  [get_ports {A[14]}]
set_input_delay -clock main_clk  -min 6  [get_ports {A[14]}]
set_input_delay -clock main_clk  -max 10  [get_ports {A[13]}]
set_input_delay -clock main_clk  -min 6  [get_ports {A[13]}]
set_input_delay -clock main_clk  -max 10  [get_ports {A[12]}]
set_input_delay -clock main_clk  -min 6  [get_ports {A[12]}]
set_input_delay -clock main_clk  -max 10  [get_ports {A[11]}]
set_input_delay -clock main_clk  -min 6  [get_ports {A[11]}]
set_input_delay -clock main_clk  -max 10  [get_ports {A[10]}]
set_input_delay -clock main_clk  -min 6  [get_ports {A[10]}]
set_input_delay -clock main_clk  -max 10  [get_ports {A[9]}]
set_input_delay -clock main_clk  -min 6  [get_ports {A[9]}]
set_input_delay -clock main_clk  -max 10  [get_ports {A[8]}]
set_input_delay -clock main_clk  -min 6  [get_ports {A[8]}]
set_input_delay -clock main_clk  -max 10  [get_ports {A[7]}]
set_input_delay -clock main_clk  -min 6  [get_ports {A[7]}]
set_input_delay -clock main_clk  -max 10  [get_ports {A[6]}]
set_input_delay -clock main_clk  -min 6  [get_ports {A[6]}]
set_input_delay -clock main_clk  -max 10  [get_ports {A[5]}]
set_input_delay -clock main_clk  -min 6  [get_ports {A[5]}]
set_input_delay -clock main_clk  -max 10  [get_ports {A[4]}]
set_input_delay -clock main_clk  -min 6  [get_ports {A[4]}]
set_input_delay -clock main_clk  -max 10  [get_ports {A[3]}]
set_input_delay -clock main_clk  -min 6  [get_ports {A[3]}]
set_input_delay -clock main_clk  -max 10  [get_ports {A[2]}]
set_input_delay -clock main_clk  -min 6  [get_ports {A[2]}]
set_input_delay -clock main_clk  -max 10  [get_ports {A[1]}]
set_input_delay -clock main_clk  -min 6  [get_ports {A[1]}]
set_input_delay -clock main_clk  -max 10  [get_ports {A[0]}]
set_input_delay -clock main_clk  -min 6  [get_ports {A[0]}]
set_input_delay -clock main_clk  -max 10  [get_ports {B[31]}]
set_input_delay -clock main_clk  -min 6  [get_ports {B[31]}]
set_input_delay -clock main_clk  -max 10  [get_ports {B[30]}]
set_input_delay -clock main_clk  -min 6  [get_ports {B[30]}]
set_input_delay -clock main_clk  -max 10  [get_ports {B[29]}]
set_input_delay -clock main_clk  -min 6  [get_ports {B[29]}]
set_input_delay -clock main_clk  -max 10  [get_ports {B[28]}]
set_input_delay -clock main_clk  -min 6  [get_ports {B[28]}]
set_input_delay -clock main_clk  -max 10  [get_ports {B[27]}]
set_input_delay -clock main_clk  -min 6  [get_ports {B[27]}]
set_input_delay -clock main_clk  -max 10  [get_ports {B[26]}]
set_input_delay -clock main_clk  -min 6  [get_ports {B[26]}]
set_input_delay -clock main_clk  -max 10  [get_ports {B[25]}]
set_input_delay -clock main_clk  -min 6  [get_ports {B[25]}]
set_input_delay -clock main_clk  -max 10  [get_ports {B[24]}]
set_input_delay -clock main_clk  -min 6  [get_ports {B[24]}]
set_input_delay -clock main_clk  -max 10  [get_ports {B[23]}]
set_input_delay -clock main_clk  -min 6  [get_ports {B[23]}]
set_input_delay -clock main_clk  -max 10  [get_ports {B[22]}]
set_input_delay -clock main_clk  -min 6  [get_ports {B[22]}]
set_input_delay -clock main_clk  -max 10  [get_ports {B[21]}]
set_input_delay -clock main_clk  -min 6  [get_ports {B[21]}]
set_input_delay -clock main_clk  -max 10  [get_ports {B[20]}]
set_input_delay -clock main_clk  -min 6  [get_ports {B[20]}]
set_input_delay -clock main_clk  -max 10  [get_ports {B[19]}]
set_input_delay -clock main_clk  -min 6  [get_ports {B[19]}]
set_input_delay -clock main_clk  -max 10  [get_ports {B[18]}]
set_input_delay -clock main_clk  -min 6  [get_ports {B[18]}]
set_input_delay -clock main_clk  -max 10  [get_ports {B[17]}]
set_input_delay -clock main_clk  -min 6  [get_ports {B[17]}]
set_input_delay -clock main_clk  -max 10  [get_ports {B[16]}]
set_input_delay -clock main_clk  -min 6  [get_ports {B[16]}]
set_input_delay -clock main_clk  -max 10  [get_ports {B[15]}]
set_input_delay -clock main_clk  -min 6  [get_ports {B[15]}]
set_input_delay -clock main_clk  -max 10  [get_ports {B[14]}]
set_input_delay -clock main_clk  -min 6  [get_ports {B[14]}]
set_input_delay -clock main_clk  -max 10  [get_ports {B[13]}]
set_input_delay -clock main_clk  -min 6  [get_ports {B[13]}]
set_input_delay -clock main_clk  -max 10  [get_ports {B[12]}]
set_input_delay -clock main_clk  -min 6  [get_ports {B[12]}]
set_input_delay -clock main_clk  -max 10  [get_ports {B[11]}]
set_input_delay -clock main_clk  -min 6  [get_ports {B[11]}]
set_input_delay -clock main_clk  -max 10  [get_ports {B[10]}]
set_input_delay -clock main_clk  -min 6  [get_ports {B[10]}]
set_input_delay -clock main_clk  -max 10  [get_ports {B[9]}]
set_input_delay -clock main_clk  -min 6  [get_ports {B[9]}]
set_input_delay -clock main_clk  -max 10  [get_ports {B[8]}]
set_input_delay -clock main_clk  -min 6  [get_ports {B[8]}]
set_input_delay -clock main_clk  -max 10  [get_ports {B[7]}]
set_input_delay -clock main_clk  -min 6  [get_ports {B[7]}]
set_input_delay -clock main_clk  -max 10  [get_ports {B[6]}]
set_input_delay -clock main_clk  -min 6  [get_ports {B[6]}]
set_input_delay -clock main_clk  -max 10  [get_ports {B[5]}]
set_input_delay -clock main_clk  -min 6  [get_ports {B[5]}]
set_input_delay -clock main_clk  -max 10  [get_ports {B[4]}]
set_input_delay -clock main_clk  -min 6  [get_ports {B[4]}]
set_input_delay -clock main_clk  -max 10  [get_ports {B[3]}]
set_input_delay -clock main_clk  -min 6  [get_ports {B[3]}]
set_input_delay -clock main_clk  -max 10  [get_ports {B[2]}]
set_input_delay -clock main_clk  -min 6  [get_ports {B[2]}]
set_input_delay -clock main_clk  -max 10  [get_ports {B[1]}]
set_input_delay -clock main_clk  -min 6  [get_ports {B[1]}]
set_input_delay -clock main_clk  -max 10  [get_ports {B[0]}]
set_input_delay -clock main_clk  -min 6  [get_ports {B[0]}]
set_input_delay -clock main_clk  -max 10  [get_ports {op[1]}]
set_input_delay -clock main_clk  -min 6  [get_ports {op[1]}]
set_input_delay -clock main_clk  -max 10  [get_ports {op[0]}]
set_input_delay -clock main_clk  -min 6  [get_ports {op[0]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[127]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[127]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[126]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[126]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[125]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[125]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[124]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[124]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[123]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[123]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[122]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[122]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[121]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[121]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[120]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[120]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[119]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[119]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[118]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[118]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[117]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[117]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[116]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[116]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[115]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[115]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[114]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[114]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[113]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[113]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[112]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[112]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[111]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[111]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[110]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[110]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[109]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[109]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[108]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[108]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[107]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[107]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[106]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[106]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[105]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[105]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[104]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[104]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[103]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[103]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[102]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[102]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[101]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[101]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[100]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[100]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[99]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[99]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[98]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[98]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[97]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[97]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[96]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[96]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[95]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[95]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[94]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[94]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[93]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[93]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[92]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[92]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[91]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[91]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[90]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[90]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[89]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[89]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[88]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[88]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[87]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[87]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[86]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[86]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[85]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[85]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[84]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[84]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[83]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[83]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[82]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[82]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[81]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[81]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[80]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[80]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[79]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[79]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[78]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[78]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[77]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[77]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[76]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[76]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[75]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[75]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[74]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[74]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[73]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[73]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[72]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[72]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[71]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[71]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[70]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[70]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[69]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[69]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[68]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[68]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[67]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[67]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[66]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[66]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[65]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[65]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[64]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[64]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[63]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[63]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[62]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[62]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[61]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[61]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[60]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[60]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[59]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[59]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[58]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[58]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[57]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[57]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[56]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[56]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[55]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[55]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[54]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[54]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[53]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[53]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[52]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[52]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[51]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[51]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[50]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[50]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[49]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[49]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[48]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[48]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[47]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[47]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[46]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[46]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[45]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[45]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[44]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[44]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[43]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[43]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[42]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[42]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[41]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[41]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[40]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[40]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[39]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[39]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[38]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[38]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[37]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[37]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[36]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[36]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[35]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[35]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[34]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[34]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[33]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[33]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[32]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[32]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[31]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[31]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[30]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[30]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[29]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[29]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[28]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[28]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[27]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[27]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[26]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[26]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[25]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[25]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[24]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[24]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[23]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[23]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[22]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[22]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[21]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[21]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[20]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[20]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[19]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[19]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[18]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[18]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[17]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[17]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[16]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[16]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[15]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[15]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[14]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[14]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[13]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[13]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[12]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[12]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[11]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[11]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[10]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[10]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[9]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[9]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[8]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[8]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[7]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[7]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[6]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[6]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[5]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[5]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[4]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[4]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[3]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[3]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[2]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[2]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[1]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[1]}]
set_output_delay -clock main_clk  -max 10  [get_ports {C[0]}]
set_output_delay -clock main_clk  -min 6  [get_ports {C[0]}]
set_input_transition -max 0.2  [get_ports clk]
set_input_transition -min 0.2  [get_ports clk]
set_input_transition -max 0.2  [get_ports resetn]
set_input_transition -min 0.2  [get_ports resetn]
set_input_transition -max 0.2  [get_ports {A[31]}]
set_input_transition -min 0.2  [get_ports {A[31]}]
set_input_transition -max 0.2  [get_ports {A[30]}]
set_input_transition -min 0.2  [get_ports {A[30]}]
set_input_transition -max 0.2  [get_ports {A[29]}]
set_input_transition -min 0.2  [get_ports {A[29]}]
set_input_transition -max 0.2  [get_ports {A[28]}]
set_input_transition -min 0.2  [get_ports {A[28]}]
set_input_transition -max 0.2  [get_ports {A[27]}]
set_input_transition -min 0.2  [get_ports {A[27]}]
set_input_transition -max 0.2  [get_ports {A[26]}]
set_input_transition -min 0.2  [get_ports {A[26]}]
set_input_transition -max 0.2  [get_ports {A[25]}]
set_input_transition -min 0.2  [get_ports {A[25]}]
set_input_transition -max 0.2  [get_ports {A[24]}]
set_input_transition -min 0.2  [get_ports {A[24]}]
set_input_transition -max 0.2  [get_ports {A[23]}]
set_input_transition -min 0.2  [get_ports {A[23]}]
set_input_transition -max 0.2  [get_ports {A[22]}]
set_input_transition -min 0.2  [get_ports {A[22]}]
set_input_transition -max 0.2  [get_ports {A[21]}]
set_input_transition -min 0.2  [get_ports {A[21]}]
set_input_transition -max 0.2  [get_ports {A[20]}]
set_input_transition -min 0.2  [get_ports {A[20]}]
set_input_transition -max 0.2  [get_ports {A[19]}]
set_input_transition -min 0.2  [get_ports {A[19]}]
set_input_transition -max 0.2  [get_ports {A[18]}]
set_input_transition -min 0.2  [get_ports {A[18]}]
set_input_transition -max 0.2  [get_ports {A[17]}]
set_input_transition -min 0.2  [get_ports {A[17]}]
set_input_transition -max 0.2  [get_ports {A[16]}]
set_input_transition -min 0.2  [get_ports {A[16]}]
set_input_transition -max 0.2  [get_ports {A[15]}]
set_input_transition -min 0.2  [get_ports {A[15]}]
set_input_transition -max 0.2  [get_ports {A[14]}]
set_input_transition -min 0.2  [get_ports {A[14]}]
set_input_transition -max 0.2  [get_ports {A[13]}]
set_input_transition -min 0.2  [get_ports {A[13]}]
set_input_transition -max 0.2  [get_ports {A[12]}]
set_input_transition -min 0.2  [get_ports {A[12]}]
set_input_transition -max 0.2  [get_ports {A[11]}]
set_input_transition -min 0.2  [get_ports {A[11]}]
set_input_transition -max 0.2  [get_ports {A[10]}]
set_input_transition -min 0.2  [get_ports {A[10]}]
set_input_transition -max 0.2  [get_ports {A[9]}]
set_input_transition -min 0.2  [get_ports {A[9]}]
set_input_transition -max 0.2  [get_ports {A[8]}]
set_input_transition -min 0.2  [get_ports {A[8]}]
set_input_transition -max 0.2  [get_ports {A[7]}]
set_input_transition -min 0.2  [get_ports {A[7]}]
set_input_transition -max 0.2  [get_ports {A[6]}]
set_input_transition -min 0.2  [get_ports {A[6]}]
set_input_transition -max 0.2  [get_ports {A[5]}]
set_input_transition -min 0.2  [get_ports {A[5]}]
set_input_transition -max 0.2  [get_ports {A[4]}]
set_input_transition -min 0.2  [get_ports {A[4]}]
set_input_transition -max 0.2  [get_ports {A[3]}]
set_input_transition -min 0.2  [get_ports {A[3]}]
set_input_transition -max 0.2  [get_ports {A[2]}]
set_input_transition -min 0.2  [get_ports {A[2]}]
set_input_transition -max 0.2  [get_ports {A[1]}]
set_input_transition -min 0.2  [get_ports {A[1]}]
set_input_transition -max 0.2  [get_ports {A[0]}]
set_input_transition -min 0.2  [get_ports {A[0]}]
set_input_transition -max 0.2  [get_ports {B[31]}]
set_input_transition -min 0.2  [get_ports {B[31]}]
set_input_transition -max 0.2  [get_ports {B[30]}]
set_input_transition -min 0.2  [get_ports {B[30]}]
set_input_transition -max 0.2  [get_ports {B[29]}]
set_input_transition -min 0.2  [get_ports {B[29]}]
set_input_transition -max 0.2  [get_ports {B[28]}]
set_input_transition -min 0.2  [get_ports {B[28]}]
set_input_transition -max 0.2  [get_ports {B[27]}]
set_input_transition -min 0.2  [get_ports {B[27]}]
set_input_transition -max 0.2  [get_ports {B[26]}]
set_input_transition -min 0.2  [get_ports {B[26]}]
set_input_transition -max 0.2  [get_ports {B[25]}]
set_input_transition -min 0.2  [get_ports {B[25]}]
set_input_transition -max 0.2  [get_ports {B[24]}]
set_input_transition -min 0.2  [get_ports {B[24]}]
set_input_transition -max 0.2  [get_ports {B[23]}]
set_input_transition -min 0.2  [get_ports {B[23]}]
set_input_transition -max 0.2  [get_ports {B[22]}]
set_input_transition -min 0.2  [get_ports {B[22]}]
set_input_transition -max 0.2  [get_ports {B[21]}]
set_input_transition -min 0.2  [get_ports {B[21]}]
set_input_transition -max 0.2  [get_ports {B[20]}]
set_input_transition -min 0.2  [get_ports {B[20]}]
set_input_transition -max 0.2  [get_ports {B[19]}]
set_input_transition -min 0.2  [get_ports {B[19]}]
set_input_transition -max 0.2  [get_ports {B[18]}]
set_input_transition -min 0.2  [get_ports {B[18]}]
set_input_transition -max 0.2  [get_ports {B[17]}]
set_input_transition -min 0.2  [get_ports {B[17]}]
set_input_transition -max 0.2  [get_ports {B[16]}]
set_input_transition -min 0.2  [get_ports {B[16]}]
set_input_transition -max 0.2  [get_ports {B[15]}]
set_input_transition -min 0.2  [get_ports {B[15]}]
set_input_transition -max 0.2  [get_ports {B[14]}]
set_input_transition -min 0.2  [get_ports {B[14]}]
set_input_transition -max 0.2  [get_ports {B[13]}]
set_input_transition -min 0.2  [get_ports {B[13]}]
set_input_transition -max 0.2  [get_ports {B[12]}]
set_input_transition -min 0.2  [get_ports {B[12]}]
set_input_transition -max 0.2  [get_ports {B[11]}]
set_input_transition -min 0.2  [get_ports {B[11]}]
set_input_transition -max 0.2  [get_ports {B[10]}]
set_input_transition -min 0.2  [get_ports {B[10]}]
set_input_transition -max 0.2  [get_ports {B[9]}]
set_input_transition -min 0.2  [get_ports {B[9]}]
set_input_transition -max 0.2  [get_ports {B[8]}]
set_input_transition -min 0.2  [get_ports {B[8]}]
set_input_transition -max 0.2  [get_ports {B[7]}]
set_input_transition -min 0.2  [get_ports {B[7]}]
set_input_transition -max 0.2  [get_ports {B[6]}]
set_input_transition -min 0.2  [get_ports {B[6]}]
set_input_transition -max 0.2  [get_ports {B[5]}]
set_input_transition -min 0.2  [get_ports {B[5]}]
set_input_transition -max 0.2  [get_ports {B[4]}]
set_input_transition -min 0.2  [get_ports {B[4]}]
set_input_transition -max 0.2  [get_ports {B[3]}]
set_input_transition -min 0.2  [get_ports {B[3]}]
set_input_transition -max 0.2  [get_ports {B[2]}]
set_input_transition -min 0.2  [get_ports {B[2]}]
set_input_transition -max 0.2  [get_ports {B[1]}]
set_input_transition -min 0.2  [get_ports {B[1]}]
set_input_transition -max 0.2  [get_ports {B[0]}]
set_input_transition -min 0.2  [get_ports {B[0]}]
set_input_transition -max 0.2  [get_ports {op[1]}]
set_input_transition -min 0.2  [get_ports {op[1]}]
set_input_transition -max 0.2  [get_ports {op[0]}]
set_input_transition -min 0.2  [get_ports {op[0]}]
